let questions = [
    {
        numb: 0,
        question: "ช่วงอายุของทำแบบสอบถาม",
        answer: "a",
        options: [
            "< 2 ปี",
            "> 2 ปี"
        ]
    },
    
    {
        numb: 1,
        type: "Major",
        question: "อาการคันของผื่น",
        options: [
            "มีอาการคันในตำแหน่งผื่น",
            "เกา หรือ ถู บริเวณผื่น บ่อยครั้ง",
            "มีร่องรอย เลือดออก ตำแหน่งผื่นหลังการเกา",
            "ไม่มีอาการดังกล่าว"
        ],
        answer: ["มีอาการคันในตำแหน่งผื่น", "เกา หรือ ถู บริเวณผื่น บ่อยครั้ง", "มีร่องรอย เลือดออก ตำแหน่งผื่นหลังการเกา"]
    },

    {
        numb: 2,
        type: "Major",
        question: "ความเรื้อรังของผื่น",
        options: [
            "เป็นผื่นลักษณะนี้ครั้งแรก",
            "เคยมีผื่นมากก่อนหน้านี้ โดยมีอาการเป็น ๆ หาย ๆ",
            "มีผื่นมาก่อนหน้านี้ เคยรับการรักษาโดยการทายา อาการดีขึ้น และกลับเป็นซ้ำ"
        ],
        answer: [
            "เคยมีผื่นมากก่อนหน้านี้ โดยมีอาการเป็น ๆ หาย ๆ",
            "มีผื่นมาก่อนหน้านี้ เคยรับการรักษาโดยการทายา อาการดีขึ้น และกลับเป็นซ้ำ"
        ]
    },

    {
        numb: 3,
        type: "Major",
        question: "ตำแหน่งของผื่น",
        options: [
            "ใบหน้า/แก้ม",
            "หนังศรีษะ",
            "ไรผม",
            "ด้านนอกของแขน และ ขา",
            "ลำตัว",
            "ข้อพับแขน",
            "ข้อพับขา"
        ],
        answer: [
            // "ใบหน้า/แก้ม",
            // "หนังศรีษะ",
            // "ไรผม",
            // "ด้านนอกของแขน และ ขา",
            // "E. ลำตัว",
            // "F. ข้อพับแขน",
            // "G. ข้อพับขา"
            "S."
        ]
    },

    {
        numb: 4,
        type: "Major",
        question: "ประวัติภูมิแพ้",
        options: [
            "คนไข้ได้รับการวินิจฉัยเป็นโรคภูมิแพ้อื่นๆ ได้แก่ ภูมิแพ้ทางเดินหายใจ หรือ หอบหืด",
            "บิดา หรือ มารดา เป็นโรคภูมิแพ้อย่างใด อย่างหนึ่ง ได้แก่ ผื่นภูมิแพ้ ภูมิแพ้ทางเดินหายใจ หรือ หอบหืด",
            "ไม่มีประวัติภูมิแพ้"
        ],
        answer: [
            "คนไข้ได้รับการวินิจฉัยเป็นโรคภูมิแพ้อื่นๆ ได้แก่ ภูมิแพ้ทางเดินหายใจ หรือ หอบหืด",
            "บิดา หรือ มารดา เป็นโรคภูมิแพ้อย่างใด อย่างหนึ่ง ได้แก่ ผื่นภูมิแพ้ ภูมิแพ้ทางเดินหายใจ หรือ หอบหืด"
        ]
    },

    {
        numb: 5.1,
        type: "Minor",
        question: "มีอาการผิวแห้ง",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.2,
        type: "Minor",
        question: "มีอาการผิวหนังรอบดวงตา แห้ง คล้ำ",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.3,
        type: "Minor",
        question: "มีอาการผื่นวงขาวตามร่างกาย / เกลื้อนน้ำนม",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.4,
        type: "Minor",
        question: "เส้นลายมือหนา",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.5,
        type: "Minor",
        question: "มีอาการผื่นแห้งรอบปาก",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.6,
        type: "Minor",
        question: "มีอาการคันตา ตาอักเสบเรื้อรัง",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.7,
        type: "Minor",
        question: "มีอาการตุ่มนูนรอบรูขุมขน",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.8,
        type: "Minor",
        question: "มีอาการผื่นแห้งคันรอบหัวนม",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.9,
        type: "Minor",
        question: "มีอาการคันเมื่อมีเหงื่อ",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.11,
        type: "Minor",
        question: "มีประวัติแพ้อาหารหรือนม",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.12,
        type: "Minor",
        question: "มีอาการระคายเคืองเมื่อใส่เสื้อผ้าเนื้อหยาบ",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.13,
        type: "Minor",
        question: "มีอาการผื่นเปลี่ยนแปลงตามฤดูกาล",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.14,
        type: "Minor",
        question: "มีรอยขาวหลังถูกขีดที่ผิวหนัง",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.15,
        type: "Minor",
        question: "มีรอยพับเป็นเส้น บริเวณคอ",
        options: [
            "มี",
            "ไม่มี"
        ],
        answer: "มี"
    },

    {
        numb: 5.16,
        type: "Minor",
        question: "ผื่นเริ่มเกิดขึ้นตั้งแต่อายุน้อยกว่า 2 ปี",
        options: [
            "ใช่",
            "ไม่ใช่"
        ],
        answer: "ใช่"
    }
];

const Question21 = {
    numb: 2.1,
    question: "มืผื่นลักษณะนี้มานานหรือยัง",
    options: [
        "1-2 สัปดาห์",
        "3-4 สัปดาห์",
        "1-3 เดือน",
        "3-6 เดือน"
    ],
    answer: ["3-6 เดือน"]
};

const questionTypes = {
    1: "Major",
    2: "Major",
    2.1: "Major", // คำถาม 2.1 เพิ่มขึ้นแบบไดนามิก
    3: "Major",
    4: "Major",
    5.1: "Minor",
    5.2: "Minor",
    5.3: "Minor",
    5.4: "Minor",
    5.5: "Minor",
    5.6: "Minor",
    5.7: "Minor",
    5.8: "Minor",
    5.9: "Minor",
    5.11: "Minor",
    5.12: "Minor",
    5.13: "Minor",
    5.14: "Minor",
    5.15: "Minor",
    5.16: "Minor"
    // เพิ่มคำถามอื่น ๆ ตามต้องการ
};

